package com.ww.JavaStudyBook23;

/**
 * @author: Sun
 * @create: 2019-12-11 11:03
 * @version: v1.0
 */
public class JavaStudyBook23 {

    /**
     * 学习手段：读书、看视频、读源码、调试、看专栏、看公众号、博客、思维导图、UML图、抓包、反汇编、反编译都可以用来学习Java相关知识。
     * 学习的最常见手段之一就是读书。
     * 就Java而言，正如前面章节研究问题时所提到的，
     * Java 学习最核心的是《Java语言手册》、《JVM语言手册》，因为这是官方最权威的资料。
     * 围绕Java语言典图书，如《Java核心技术》、《Java编程思想》、《深入理解Java虛拟机》、《码出高效》等。
     * Java开发岗位涉及到技术的官方手册，如Spring、MyBatis、Hibernate等官方手册等。
     * Java开发岗位涉及到的技术的经典图书，如《Redis深度历险:核心原理与应用实践》、《深入理解Apache Dubbo与实战》等。
     * 介绍编程技巧的书，如《重构:改善既有代码的设计》、《编写可读代码的艺术》、《代码整洁之道》、《修改软件的艺术》、《Effective Java》等。
     *
     * 读书最关键的是选对书，其次是看书的方法。
     * 选取适合自己层次的图书很重要，初学者以介绍用法的图书为主，进阶的同学以读官方手册和相关的经典图书为主。很多人读技术的书都会有这样的困惑:
     * 很多书读了一两遍还是会忘。这是一个非常正常的现象。为了克服遗忘，重点的图书需要反复阅读，这也就是所谓的“书读百遍其义自见”，阅读时要加
     * 入一些思考，将所学知识和已经有的知识体系结合在一起。
     *
     * 学习方法：
     * (1)推演验证：首先确定一个开源项目或本公司项目中感兴趣的模块，找到需要文档或者已上线的产品去查看或试用。然后反推实现方式，自己出一个技术方案，
     * 和现有的技术方案作对比。通过对比找出自己设计的缺陷，思考对方当初为何这么设计，努力找出对方设计可以改进的地方。不断的推演和验证。
     * (2)费曼学习法：
     *    ①选择目标：确定一个目标/知识，去进行学习；
     *    ②教学：创造场景，将所学习到的知识讲述给别人，在这个步骤中可能会遇到有的覅方说不清楚、讲不明白，那就说明这些知识点并没有熟练掌握。尝试教授和发现薄弱点是这一步的重点。
     *    ③纠错学习：第二步中遇到的问题，这一步中来进行解决。反复查询资料、学习、强化记忆，然后重复第二步进行验证，直到可以顺利教授相应的知识。
     *    ④简化：对上面学习的内容进行提炼、简化、去掉多余的信息，最终能够用自己的语言通俗易懂的表达出来自己所学习的内容。
     */
}
