package com.ww.LetSLearnMindMaps28;

/**
 * @author: Sun
 * @create: 2019-12-26 16:35
 * @version: v1.0
 */
public class LetSLearnMindMaps28 {

    /**
     * 1、什么是思维导图？
     * 思维导图：思维导图是一种可视化的图形思维工具，思维导图通过层级化的方式展示部分和整体的关系。
     * 因此思维导图的核心之一就是拆分，即将整体合理地拆分成多个部分，以便于理解。
     *
     * 2、Xmind中一些基本概念：
     * Topic (主题)、Subtopic ( 子主题)、RelationShip (联系)、Summary (概括)、Boundary (边界)、Notes ( 笔记)。
     * 其中主题和子主图是思维导图的核心;边界用来区分不同的概念领域;联系主要用来描述跨层知识之间的关系;概括则将多个知识点汇总为一个;
     * 笔记主要用来描述知识点。
     *
     * 3、借助思维导图我们可以：
     * 明确问题的输入和输出;
     * 可以通过思维导图对知识进行拆分，可以通过归纳的方法去总结知识，也可以通过演绎的方法去运用知识，还可以通过思维导图理清各种知识之间的逻辑关系;
     * 可以通过思维导图了解学习内容的本质，通过分而治之的方式将复杂的问题简单化；
     * 并且思维导图的同级知识之间有相互独立性。
     *
     * 4、画思维导图的一些误区：
     * (1)思维导图并不是越大越详细越好，思维导图的一个主要目的是压缩知识。
     * (2)思维导图的知识点之间如果不独立，则压缩知识就不够充分，知识之间的关系就不够明确。
     * (3)如果思维导图的知识之间毫无逻辑关系，没有太大意义，无法帮助我们理解知识，无法发挥出思维导图的优势。思维导图的一大作用就是帮助我们理解知识，
     * 寻找知识的关联，形成知识网络，帮助我们加深印象。
     * (4)随着学习的不断深入，之前的思维导图可能存在错误、遗漏等情况，这就需要对思维导图进行更新，然而很多人即使有新的理解也不愿意去更新思维导图，
     * 这样思维导图的价值就会非常有限。
     */
}
